priv/static/doc/html/elements/jqgrid.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>jQGrid Element</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-02-06 22:53:09 GMT"/>
<meta name="author" content="Roman Shestakov (@rshestakov)"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
</head>
<body>
<div id="content">

<h1 class="title">jQGrid Element</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Tabs Element - #jqgrid {} </a>
<ul>
<li><a href="#sec-1.1">1.1 Usage </a></li>
<li><a href="#sec-1.2">1.2 Attributes </a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Tabs Element - #jqgrid {} </h2>
<div class="outline-text-2" id="text-1">


<p>
The implementation of jQGrid element.
</p>

</div>

<div id="outline-container-1.1" class="outline-3">
<h3 id="sec-1.1"><span class="section-number-3">1.1</span> Usage </h3>
<div class="outline-text-3" id="text-1.1">





<pre class="example">
#jqgrid{
    id = jqgrid,
    options=[
        {url, 'get_jqgrid_data'},
        {datatype, &lt;&lt;"json"&gt;&gt;},
        {colNames, ['ID', 'Name', 'Values']},
        {colModel, [
            [{name, 'id'}, {index, 'id'}, {width, 55}],
            [{name, 'name'}, {index, 'name1'}, {width, 80}],
            [{name, 'values1'}, {index, 'values1'}, {width, 100}]
        ]},
        {rowNum, 10},
        {rowList, [10, 20, 30]},
        {sortname, 'id'},
        {viewrecords, true},
        {sortorder, &lt;&lt;"desc"&gt;&gt;},
        {caption, &lt;&lt;"JSON Example"&gt;&gt;}
    ],
    actions = [
        #jqgrid_event{trigger = jqgrid, target = jqgrid, type = ?BEFOREREQUEST, postback = before_rqt},
        #jqgrid_event{trigger = jqgrid, target = jqgrid, type = ?BEFORESELECTROW, postback = before_slc_row},
        #jqgrid_event{trigger = jqgrid, target = jqgrid, type = ?ONSELECTROW, postback = select_row},
        #jqgrid_event{trigger = jqgrid, target = jqgrid, type = ?ONCELLSELECT, postback = select_cell},
        #jqgrid_event{trigger = jqgrid, target = jqgrid, type = ?AFTERINSERTROW, postback = after_insert_row},
        #jqgrid_event{trigger = jqgrid, target = jqgrid, type = ?ONDBLCLICKROW, postback = on_dblclick},
        #jqgrid_event{trigger = jqgrid, target = jqgrid, type = ?ONRIGHTCLICKROW, postback = on_right_click},
        #jqgrid_event{trigger = jqgrid, target = jqgrid, type = ?ONHEADERCLICK, postback = on_header_click}
    ]
}

</pre>




</div>

</div>

<div id="outline-container-1.2" class="outline-3">
<h3 id="sec-1.2"><span class="section-number-3">1.2</span> Attributes </h3>
<div class="outline-text-3" id="text-1.2">


</div>
</div>
</div>
<div id="postamble">
<p class="author"> Author: Roman Shestakov (@rshestakov)
<a href="mailto:">&lt;&gt;</a>
</p>
<p class="date"> Date: 2013-02-06 22:53:09 GMT</p>
<p class="creator">HTML generated by org-mode 6.33x in emacs 23</p>
</div>
</div>
</body>
</html>
